In [17]:
import pandas as pd
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [5]:
df = pd.read_csv("titanic.txt")

In [8]:
df.drop(['SexCode'], axis=1, inplace=True)

In [10]:
df.drop(df[df['Sex']!='male'].index)

                                     Name PClass    Age   Sex  Survived
2     Allison, Mr Hudson Joshua Creighton    1st  30.00  male         0
4           Allison, Master Hudson Trevor    1st   0.92  male         1
5                      Anderson, Mr Harry    1st  47.00  male         1
7                  Andrews, Mr Thomas, jr    1st  39.00  male         0
9                  Artagaveytia, Mr Ramon    1st  71.00  male         0
...                                   ...    ...    ...   ...       ...
1308                   Zakarian, Mr Artun    3rd  27.00  male         0
1309               Zakarian, Mr Maprieder    3rd  26.00  male         0
1310                     Zenni, Mr Philip    3rd  22.00  male         0
1311                     Lievens, Mr Rene    3rd  24.00  male         0
1312                       Zimmerman, Leo    3rd  29.00  male         0

[851 rows x 5 columns]

In [11]:
df.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived
1307  Zabour, Miss Tamini    3rd   NaN  female         0
1312       Zimmerman, Leo    3rd  29.0    male         0

In [12]:
df.groupby(['Sex']).count()

        Name  PClass  Age  Survived
Sex
female   462     462  288       462
male     851     851  468       851

In [18]:
df.groupby(['Sex', 'Survived']).mean()

                       Age
Sex    Survived
female 0         24.901408
       1         30.867143
male   0         32.320780
       1         25.951875